//
//  impartStringData.swift
//  Ast
//
//  Created by 변윤나 on 2/2/25.
//

import Foundation


struct ImpartStringData: Equatable, Hashable {
    static let impartText:[String] = [
        "💝 \"💰\"는 일일운세에서 복채를 내거나 캘린더에서 하루에 한번씩 제공됩니다.",
        "📣 \"💰\"를 얻어 운세 캘린더를 꾸며 보세요!",
        "🎀 프리미엄 가입시 드리는 혜택! (년간운세,계정전환,리포트등 제공)",
        "👩🏻‍❤️‍👨🏻 (준비중)계정을 늘릴 수 있어요! 연인,친구,가족의 정보를 추가해 보세요.",
        "👀 Hex코드를 이용해 앱을 나만의 분위기로 바꿔봐요!",
//        "🙇🏻‍♀️ 무료버전 이용시 다수의 계정 사용을 막기 위해 프로필 정보는 총 5회까지 수정 가능해요.",
        "🚨 프로필 정보를 수정하였더라도 다음 운세부터 수정 사항이 반영돼요.",
        "🔮 태어난 시간, 출생지를 추가하면 더욱 정확한 운세를 받아 볼 수 있어요.",
        "😉 일일운세는 매일 오전 05:15분에 반영돼요.🎀",
        "🌙 주.월.년간 운세는 자정 00:00분에 업데이트 돼요.",
        "🚨 프로필 정보를 수정하였더라도 다음 운세부터 내용이 반영돼요.",
    ]
}

